// імпортуємо бібліотеки
#include <iostream> // для вводу/виводу
#include <math.h> // для математичних обчислен по типу: cos, tan, etc.
#include <windows.h> // ця для переведення консолі на UTF-8

// ==================================
// Завдання 1
// ==================================
void task1() {
    float number; // оголошуємо змінну з типом float

    printf("Введіть число: ");
    std::cin >> number; // отримання даних з інпуту та заносимо його в змінну number 

    // .2f - де 2 це кількість символів пілся крапки
    printf("%.2f", number);
}


// ==================================
// Завдання 2.1
// ==================================

// винесені функції для обрахунків по заданим варіантом формулам
double f(double x) { return tan(x) - 4 * pow(x, 3); }
double f1(double z) { return 1.0 / pow(cos(z), 2); }
double f2(double z) { return z - log(std::abs(z)); }
double f3(double z) { return tan(z + 1.0 / z); }


void task2_1() {
    double x;
    double y;

    // c = 1.5 згідно варіанту 8
    const double c = 1.5;
    const double z = cos(c);

    // вибираємо потрібну функцію для обчислення X в залежності від значення Z
    if (z < 0) {
        x = f1(z);
    }
    else if (z >= 0 && z <= 8) {
        x = f2(z);
    }
    else if (z > 8) {
        x = f3(z);
    }

    // обрахунок y за формулою f(x)
    y = f(x);

    printf("Для c = %f маємо z = %f\n", c, z);
    printf("Обчислене x = %f\n", x);
    printf("Результат y = f(x) = %f\n", y);
}


// ==================================
// Завдання 2.2
// ==================================
void task2_2() {
    int choice;
    double value, a, b, h, S;

    // вивід меню
    printf("Елементи трикутника:\n");
    printf("1 - катет a\n");
    printf("2 - гіпотенуза b\n");
    printf("3 - висота h\n");
    printf("4 - площа S\n");

    // ввід для вибору в меню
    printf("Введіть номер відомого елемента (1-4): ");
    std::cin >> choice;

    // ввід значення для вибраного в меню елемента
    printf("Введіть його значення: ");
    std::cin >> value;

    // перевірка, щоб значення не було від'ємним або нулем
    if (value <= 0) {
        printf("Значення елемента трикутника має бути більше нуля!\n");
        return;
    }

    switch (choice) {
    case 1: // обробка коли відомий катет a
        a = value;
        b = a * sqrt(2.0);
        h = a / sqrt(2.0);
        S = pow(a, 2) / 2.0;
        break;
    case 2: // обробка коли відома гіпотенуза b
        b = value;
        a = b / sqrt(2.0);
        h = b / 2.0;
        S = pow(b, 2) / 4.0;
        break;
    case 3: // обробка коли відома висота h
        h = value;
        a = h * sqrt(2.0);
        b = 2.0 * h;
        S = pow(h, 2);
        break;
    case 4: // обробка коли відома площа S
        S = value;
        a = sqrt(2.0 * S);
        b = 2.0 * sqrt(S);
        h = sqrt(S);
        break;
    default: // якщо не ввели з переліку
        printf("Помилка: Невідомий номер елемента!\n");
        return;
    }

    // вивід результатів
    printf("\n--- Результати обчислень ---\n");
    printf("Катет a      = %.4f\n", a);
    printf("Гіпотенуза b = %.4f\n", b);
    printf("Висота h     = %.4f\n", h);
    printf("Площа S      = %.4f\n", S);
}


// ==================================
// Завдання 3.1
// ==================================
void task3_1() {
    int n;

    // використовуємо do/while для інпуту та валідації кількості елементів послідовності
    do {
        printf("Введіть кількість елементів послідовності n (n > 0): ");
        std::cin >> n;

        // валідація
        if (n <= 0) {
            printf("Помилка! Кількість має бути більшою за нуль.\n");
        }
    } while (n <= 0);

    int current_val;
    int min_val;
    int min_index = 1;

    // окремо беремо значення першого елементу 
    printf("Введіть елемент 1: ");
    std::cin >> min_val;

    // цикл для обробки наступних елементів послідовності
    for (int i = 2; i <= n; i++) {
        printf("Введіть елемент %d: ", i);
        std::cin >> current_val;

        // якщо елемнт менше мінімального то робимо той елемент мінімальним та вказуємо його індекс
        if (current_val < min_val) {
            min_val = current_val;
            min_index = i;
        }
    }

    // вивід результатів
    printf("\nМінімальний елемент: %d\n", min_val);
    printf("Номер мінімального елемента: %d\n", min_index);
}

// ==================================
// Завдання 3.2
// =================================
void task3_2() {
    double a = 1.0;
    double b = 4.0;
    double h = 0.2; // або ж C в таблиці до завдання

    printf("-------------------------\n");
    printf("|    x     |    F(x)    |\n");
    printf("-------------------------\n");

    double x = a; // беремо перше число початку діапазону

    // цикл while для побудови таблиці
    // додаємо h / 2.0 до межі b, щоб уникнути втрати останнього кроку
    while (x <= b + h / 2.0) {
        double F = sin(1.0 / x) + 2.0;

        // виведення рядка таблиці
        // %8.4f - де виділити 8 позицій, з них 4 після коми
        printf("| %8.4f | %10.4f |\n", x, F);
        x += h;
    }
    printf("-------------------------\n");
}

// ==================================
// меін та функція для більш красивого виводу 
// ==================================
void printTask(double task_num) {
    printf("\n\n=================================\n");
    if (task_num == (int)task_num) {
        printf(" Завдання %d: \n", (int)task_num);
    }
    else {
        printf(" Завдання %.1f: \n", task_num);
    }
    printf("=================================\n");
}

int main()
{
    // ставимо в консолі кодування UTF-8 
    SetConsoleOutputCP(65001);
    SetConsoleCP(65001);

    printTask(1);
    task1();

    printTask(2.1);
    task2_1();

    printTask(2.2);
    task2_2();

    printTask(3.1);
    task3_1();

    printTask(3.2);
    task3_2();
}